//********************************************************************
//********************************************************************
//************************ Optional Checking *************************
//********************************************************************
//********************************************************************

var testValue:String? = "Test"

//第一種方法
if testValue != nil{
    print("該Optional變數有值: \(testValue!)")
}else{
    print("該Optional變數沒有值")
}

//第二種方法
if let gotValue = testValue{
    print("該Optional變數有值: \(gotValue)")
}else{
    print("該Optional變數沒有值")
}